In [2]:
import pandas as pd
import numpy as np

In [3]:

df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'id': [2, 3, 4],
    'score': [90, 85, 88]
})

In [4]:
df1

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie

In [5]:
df2

   id  score
0   2     90
1   3     85
2   4     88

In [ ]:
# inner, outer, left, right...

In [8]:
a = pd.Series([1,2,2,4,5])
a

0    1
1    2
2    2
3    4
4    5
dtype: int64

In [9]:
# I've to merge two dataframes by using two common columns name!

In [10]:
pd.merge(df1, df2, on="id", how="left")

   id     name  score
0   1    Alice    NaN
1   2      Bob   90.0
2   3  Charlie   85.0

In [12]:
pd.merge(df1, df2, on="id", how="right")

   id     name  score
0   2      Bob     90
1   3  Charlie     85
2   4      NaN     88

In [14]:
# intersection of both dataframes
pd.merge(df1, df2, on="id", how="inner")

   id     name  score
0   2      Bob     90
1   3  Charlie     85

In [16]:
# union
pd.merge(df1, df2, on="id", how="outer")

   id     name  score
0   1    Alice    NaN
1   2      Bob   90.0
2   3  Charlie   85.0
3   4      NaN   88.0

In [24]:
# Concat

In [25]:
df3 = pd.DataFrame({'A' : ['A0', 'A1'], 'B' : ['B0', 'B1']})
df4 = pd.DataFrame({'A' : ['A1', 'A3'], 'B' : ['B2', 'B3']})

In [26]:
df3

    A   B
0  A0  B0
1  A1  B1

In [27]:
df4

    A   B
0  A1  B2
1  A3  B3

In [33]:
pd.concat([df3, df4], axis=0)

    A   B
0  A0  B0
1  A1  B1
0  A1  B2
1  A3  B3